#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/naga-paritala/terraform-samples/runs/run-y4ZuLUQYNKrJgZt8

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
2020/12/14 17:33:44 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/12/14 17:33:44 [INFO] Terraform version: 0.14.0  
2020/12/14 17:33:44 [INFO] Go runtime version: go1.15.2
2020/12/14 17:33:44 [INFO] CLI args: []string{"/usr/local/bin/terraform", "plan", "-out", "/terraform/terraform.tfplan", "-detailed-exitcode", "-var-file=/terraform/terraform.tfvars", "-lock=false", "-parallelism=10"}
2020/12/14 17:33:44 Loading CLI configuration from /tmp/cli.tfrc
2020/12/14 17:33:44 [INFO] CLI command args: []string{"plan", "-out", "/terraform/terraform.tfplan", "-detailed-exitcode", "-var-file=/terraform/terraform.tfvars", "-lock=false", "-parallelism=10"}
2020/12/14 17:33:44 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/12/14 17:33:45 [INFO] Failed to read plugin lock file .terraform/plugins/linux_amd64/lock.json: open .terraform/plugins/linux_amd64/lock.json: no such file or directory
2020/12/14 17:33:45 [INFO] backend/local: starting Plan operation
2020-12-14T17:33:46.248Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T17:33:46.328Z [INFO]  plugin.terraform-provider-aws_v3.21.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T17:33:46.328Z
2020-12-14T17:33:46.618Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020-12-14T17:33:46.621Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T17:33:46.668Z [INFO]  plugin.terraform-provider-null_v3.0.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T17:33:46.668Z
2020-12-14T17:33:46.797Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020-12-14T17:33:46.798Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T17:33:46.845Z [INFO]  plugin.terraform-provider-random_v3.0.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T17:33:46.845Z
2020-12-14T17:33:46.976Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Canceled desc = context canceled"
2020/12/14 17:33:46 [INFO] terraform: building graph: GraphTypeValidate
2020-12-14T17:33:46.989Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T17:33:47.077Z [INFO]  plugin.terraform-provider-aws_v3.21.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T17:33:47.077Z
2020-12-14T17:33:47.542Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020/12/14 17:33:47 [INFO] backend/local: plan calling Plan
2020/12/14 17:33:47 [INFO] terraform: building graph: GraphTypePlan
2020-12-14T17:33:47.555Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T17:33:47.651Z [INFO]  plugin.terraform-provider-aws_v3.21.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T17:33:47.651Z
2020/12/14 17:33:48 [INFO] ReferenceTransformer: reference not found: "var.cidr_block"
s_vpc.main_vpc" references: []
module.eks.aws_iam_role.eks_role: Refreshing state... [id=eks-cluster-role]
module.vpc.aws_vpc.main_vpc: Refreshing state... [id=vpc-0fa73d89a8706ce7d]
module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-role-20201214153016004600000002]
module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController: Refreshing state... [id=eks-cluster-role-20201214153015988400000001]
module.vpc.aws_internet_gateway.main_internet_gateway: Refreshing state... [id=igw-02eb9d8a0bc2db876]
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
s: []
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
module.vpc.aws_subnet.private_be: Refreshing state... [id=subnet-0223fc1a02a2f2569]
module.vpc.aws_eip.nat_be: Refreshing state... [id=eipalloc-096fa1d76ede9db69]
module.vpc.aws_subnet.private_db: Refreshing state... [id=subnet-01c9aca5b8fa725aa]
module.vpc.aws_eip.nat_db: Refreshing state... [id=eipalloc-0bc9c0830e92f9c5e]
module.vpc.aws_subnet.public_fe: Refreshing state... [id=subnet-09ebe1bfc664b24a8]
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy"
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController"
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2020/12/14 17:33:49 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_eks_cluster.eks_cluster, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .vpc_config[0].endpoint_private_access: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .vpc_config[0].endpoint_public_access: planned value cty.True does not match config value cty.NullVal(cty.Bool)
      - .kubernetes_network_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
module.vpc.aws_nat_gateway.nat_gw_db: Refreshing state... [id=nat-069a09d2334f80b77]
2020/12/14 17:33:49 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
module.vpc.aws_nat_gateway.nat_gw_be: Refreshing state... [id=nat-0de6f00fbccfb1a1d]
2020-12-14T17:33:50.022Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020/12/14 17:33:50 [INFO] backend/local: plan operation completed
2020/12/14 17:33:50 [INFO] backend/local: writing plan output to: /terraform/terraform.tfplan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks_cluster"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::801210904757:role/eks-cluster-role"
      + status                = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-09ebe1bfc664b24a8",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_role.eks_role will be updated in-place
  ~ resource "aws_iam_role" "eks_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks.amazonaws.com"
                        }
                    },
                  + {
                      + Action   = "eks:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "eksadministrator"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "eks-cluster-role"
        name                  = "eks-cluster-role"
        tags                  = {}
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>
*Pusher: @malliparitala, Action: `pull_request`*